const tearim_shaliach = `שפיץ
כריזמטי
אש בעיניים
עם אנרגיות מטורפות
מחפש רק להרים
מטורלל
חולה בראש
חולה בנשמה
חולה בגוף
בן אנד ג'ריס
אוהב את החיים
אח יקר ואהוב
שותף על מלא
אידיאליסט
חמישי נודר שישי דוקר
שבת שומר
ירא שמיים
שטייגעניסט
מועמד לניהול משנה של פורום אנג'ל
שרברב
מומו
חצוצרן
תמיד מחייך
חובש כיפה
סוס פרא
פופ סטאר
רוק סטאר
סופר סטאר
סופר סטרייקה
מישהו לרוץ איתו
מישהו ללכת איתו
תותח
יורד ים
יורה דעה
ראבקיסט
איש יקר ואהוב מאוד
מורעל על בני עקיבא
מעריץ של הסופר
עם כריזמה בארגזים
פול סטאק אינג'ניר
משוגע
חובב טניס
מורעל
גרזן
מגניב
פופולרי
מזניב
מרהיב
מלבב
רוצה מכות
אוהב לבשל
אוהב בנות
רוצה להתחתן עוד השנה בעזרת ה'
בלי נדר
בלחיסט
ליברל
פלורליסט
כריש
דולפין
אריה ים
שועל
דג נקאי
פוסטמודרניסט
ניהיליסט
אקזיסטנציאליסט
קווניק
גושניק
גדלת על אסי וטוביה
הוגה דעות
יש לך קורת רוח
ראית צבי הנינג'ה
פַלוּפּ
ליצן
פָּצוּץ
שבּוּר
אוטודידקט
פרילנסר
דוס אבל פתוח
שולמן
יוסי!
צהוב
ילד של אימא
נער חשמלי
מתאקלם כמו זיקית`.split('\n')

const tearim_snif = `חם
אוהב
משפחתי
היברידי
מלבב
מאיר
נעים
מעיר פנים
אוהב
מחבק
משמח
ירוק
גדול
אקולוגי
מתקלף
קצת דולף
חמוד
אהוב
פצצה
פגז
נפץ
מרנין
מרהיב
מלהיב
חשמלי
אלקטרוני
מזניב
שאוהב את הבריות
שמקרב את הבריות לתורה
שהוא מתלמידיו של אהרון
אוהב שלום
רודף שלום
שרודף אחרי הזנב של עצמו
רודף בצע
שונא בצע
שונא זבובים
אוהב חומוס, אוהב גם טחינה
שמכלכל את חניכיו
שאוכל את יושביו
שמופיע בנטפליקס
שמותר בו נטפליקס
שצבוע בצבעי הסוואה
יושב טוב
בורגני
שממוקם גאוגרפית
שיש לו דעה פוליטית נחרצת
איכותי
עם חניכים מקסימים
עם צוות מחורפן
עם אווירה בשמיים
עם חינגיא שחבל על הזמן
מטריף
עם סגל משכמו ומעלה
מצחיקול
ליברלי
אוטודידקטי
שמרני
חרדלי, קטשופי
ספורטיבי
שאוהב לשחק בכדור רשת
שגר בפריפריה אבל מרגיש כמו במרכז
בלחי
שמתנגד למיץ תפוזים עם חתיכות
מפדלניק
חבדניק
ליטאי
חסידי
שהוא אח
אומנותי
ארטיסטי
אריסטוקרטי
אריסטוטלי
אפלטוני
שדוגל באהבה ללא תנאים
שדוגל ביראת חטא
אמיץ
אקטיביסטי
אידיאליסטי
שממית עצמו באהלה של תורה
דוס אבל פתוח`.split('\n')

const sninfim_names = `מעלה גרה
אהוד בן גרא
מעלה חמציצים
מעלה אליהו
גוב האריות
גבעת הכיסאות
נווה חשמל
נווה עצלנות
מג'דל שמס
נטע שורק
נטע רבעי
אהלה של תורה
פניני הלכה
אהלי הלכה
דרכי התלמוד
י"ג מידות
י"ג למצוות
נהר הירקון
נהר דעא
פומבדיתא
בני סכנין
אום אל פחם
יחווה דעת
חזון עובדיה
חונטוזה
נרניה
הקוטב הדרומי
בה סינג סה
אומשו
קיושי
פיליפינים
בהוטן
קוריאה הצפונית
שער הרחמים
שער הדמעות
ים של דמעות
ים הרחמים
כפתור ופרח
ענבי הגפן
קצות החושן
שערי יושר
נתיבות המשפט
נועם יפת`.split('\n')

const alenu = `אוכל
שינה
כיף
לינה
עונג
שמחה
ברכה
שלום
אהבה
חדווה
אחווה
רעות
טירוף
תנאים גשמיים
שידוך כמובןן
ששון
הנאה
מזון
כלה (כבחמורה)
פרנסה
בריאות
זיווג הגון
תורה
עבודה
גמילות חסדים
בורקסים
שניצל תירס
בורקיטס
אפוטרופוס
במבה
עיסוק חברתי
שוקו חם
משחקי קופסה
צחוק
שחוק
מצעים
חולצת תנועה
הסעות
נר לקידוש
יין להבדלה
עצי בשמים
משקפי שמש
יין ויאנג
מחבט טניס
רובה אם-4 מקוצרר
מטען נייד
אקסטרה מאמץ
קידוש ה'
קידושא רבה
תורת ארץ ישראל`.split('\n')


const komo = `אורי'ה
חדווה
ברכה
תהילה
חירות
שלהבתי'ה
תפארת
אמונה
הודי'ה
צופי'ה
י'הל
אי'ילה
דלילה
תחי'ה
מאירה
מורי'ה
שלומציון
שלומית
עטרת
עטרה
פטרת
רעי'ה
ראי'ה
עדי'ה
הילה
צבי'ה
אחווה
אדווה
תהל
הדר
הדס
הדסה
אסתר
דסי
אלונה
אילנה
אילנית
אורנית
סתוונית
אביבה
אביבית
רעות
נהורה
קושי'ה
פנינה
לאה
טליה
אורה
אודי'ה
אודה-י'ה
נוי'ה
נועה
נעם
יפה
תמה
תורה
תמימה`.split('\n')

const numbers = `585565174
587658494
546512125
523836550
584786395
546718848
556678020
586788793`.split('\n')

var emojis = [
	'😄','😃','😀','😊','☺','😉','😍','😘','😚','😗','😙','😜','😝','😛','😳','😁','😔','😌','😒','😞','😣','😢','😂','😭','😪','😥','😰','😅','😓','😩','😫','😨','😱','😠','😡','😤','😖','😆','😋','😷','😎','😴','😵','😲','😟','😦','😧','😈','👿','😮','😬','😐','😕','😯','😶','😇','😏','😑','👲','👳','👮','👷','💂','👶','👦','👧','👨','👩','👴','👵','👱','👼','👸','😺','😸','😻','😽','😼','🙀','😿','😹','😾','👹','👺','🙈','🙉','🙊','💀','👽','💩','🔥','✨','🌟','💫','💥','💢','💦','💧','💤','💨','👂','👀','👃','👅','👄','👍','👎','👌','👊','✊','✌','👋','✋','👐','👆','👇','👉','👈','🙌','🙏','☝','👏','💪','🚶','🏃','💃','👫','👪','👬','👭','💏','💑','👯','🙆','🙅','💁','🙋','💆','💇','💅','👰','🙎','🙍','🙇','🎩','👑','👒','👟','👞','👡','👠','👢','👕','👔','👚','👗','🎽','👖','👘','👙','💼','👜','👝','👛','👓','🎀','🌂','💄','💛','💙','💜','💚','❤','💔','💗','💓','💕','💖','💞','💘','💌','💋','💍','💎','👤','👥','💬','👣','💭','🐶','🐺','🐱','🐭','🐹','🐰','🐸','🐯','🐨','🐻','🐷','🐽','🐮','🐗','🐵','🐒','🐴','🐑','🐘','🐼','🐧','🐦','🐤','🐥','🐣','🐔','🐍','🐢','🐛','🐝','🐜','🐞','🐌','🐙','🐚','🐠','🐟','🐬','🐳','🐋','🐄','🐏','🐀','🐃','🐅','🐇','🐉','🐎','🐐','🐓','🐕','🐖','🐁','🐂','🐲','🐡','🐊','🐫','🐪','🐆','🐈','🐩','🐾','💐','🌸','🌷','🍀','🌹','🌻','🌺','🍁','🍃','🍂','🌿','🌾','🍄','🌵','🌴','🌲','🌳','🌰','🌱','🌼','🌐','🌞','🌝','🌚','🌑','🌒','🌓','🌔','🌕','🌖','🌗','🌘','🌜','🌛','🌙','🌍','🌎','🌏','🌋','🌌','🌠','⭐','☀','⛅','☁','⚡','☔','❄','⛄','🌀','🌁','🌈','🌊','🎍','💝','🎎','🎒','🎓','🎏','🎆','🎇','🎐','🎑','🎃','👻','🎅','🎄','🎁','🎋','🎉','🎊','🎈','🎌','🔮','🎥','📷','📹','📼','💿','📀','💽','💾','💻','📱','☎','📞','📟','📠','📡','📺','📻','🔊','🔉','🔈','🔇','🔔','🔕','📢','📣','⏳','⌛','⏰','⌚','🔓','🔒','🔏','🔐','🔑','🔎','💡','🔦','🔆','🔅','🔌','🔋','🔍','🛁','🛀','🚿','🚽','🔧','🔩','🔨','🚪','🚬','💣','🔫','🔪','💊','💉','💰','💴','💵','💷','💶','💳','💸','📲','📧','📥','📤','✉','📩','📨','📯','📫','📪','📬','📭','📮','📦','📝','📄','📃','📑','📊','📈','📉','📜','📋','📅','📆','📇','📁','📂','✂','📌','📎','✒','✏','📏','📐','📕','📗','📘','📙','📓','📔','📒','📚','📖','🔖','📛','🔬','🔭','📰','🎨','🎬','🎤','🎧','🎼','🎵','🎶','🎹','🎻','🎺','🎷','🎸','👾','🎮','🃏','🎴','🀄','🎲','🎯','🏈','🏀','⚽','⚾','🎾','🎱','🏉','🎳','⛳','🚵','🚴','🏁','🏇','🏆','🎿','🏂','🏊','🏄','🎣','☕','🍵','🍶','🍼','🍺','🍻','🍸','🍹','🍷','🍴','🍕','🍔','🍟','🍗','🍖','🍝','🍛','🍤','🍱','🍣','🍥','🍙','🍘','🍚','🍜','🍲','🍢','🍡','🍳','🍞','🍩','🍮','🍦','🍨','🍧','🎂','🍰','🍪','🍫','🍬','🍭','🍯','🍎','🍏','🍊','🍋','🍒','🍇','🍉','🍓','🍑','🍈','🍌','🍐','🍍','🍠','🍆','🍅','🌽','🏠','🏡','🏫','🏢','🏣','🏥','🏦','🏪','🏩','🏨','💒','⛪','🏬','🏤','🌇','🌆','🏯','🏰','⛺','🏭','🗼','🗾','🗻','🌄','🌅','🌃','🗽','🌉','🎠','🎡','⛲','🎢','🚢','⛵','🚤','🚣','⚓','🚀','✈','💺','🚁','🚂','🚊','🚉','🚞','🚆','🚄','🚅','🚈','🚇','🚝','🚋','🚃','🚎','🚌','🚍','🚙','🚘','🚗','🚕','🚖','🚛','🚚','🚨','🚓','🚔','🚒','🚑','🚐','🚲','🚡','🚟','🚠','🚜','💈','🚏','🎫','🚦','🚥','⚠','🚧','🔰','⛽','🏮','🎰','♨','🗿','🎪','🎭','📍','🚩','⬆','⬇','⬅','➡','🔠','🔡','🔤','↗','↖','↘','↙','↔','↕','🔄','◀','▶','🔼','🔽','↩','↪','ℹ','⏪','⏩','⏫','⏬','⤵','⤴','🆗','🔀','🔁','🔂','🆕','🆙','🆒','🆓','🆖','📶','🎦','🈁','🈯','🈳','🈵','🈴','🈲','🉐','🈹','🈺','🈶','🈚','🚻','🚹','🚺','🚼','🚾','🚰','🚮','🅿','♿','🚭','🈷','🈸','🈂','Ⓜ','🛂','🛄','🛅','🛃','🉑','㊙','㊗','🆑','🆘','🆔','🚫','🔞','📵','🚯','🚱','🚳','🚷','🚸','⛔','✳','❇','❎','✅','✴','💟','🆚','📳','📴','🅰','🅱','🆎','🅾','💠','➿','♻','♈','♉','♊','♋','♌','♍','♎','♏','♐','♑','♒','♓','⛎','🔯','🏧','💹','💲','💱','©','®','™','〽','〰','🔝','🔚','🔙','🔛','🔜','❌','⭕','❗','❓','❕','❔','🔃','🕛','🕧','🕐','🕜','🕑','🕝','🕒','🕞','🕓','🕟','🕔','🕠','🕕','🕖','🕗','🕘','🕙','🕚','🕡','🕢','🕣','🕤','🕥','🕦','✖','➕','➖','➗','♠','♥','♣','♦','💮','💯','✔','☑','🔘','🔗','➰','🔱','🔲','🔳','◼','◻','◾','◽','▪','▫','🔺','⬜','⬛','⚫','⚪','🔴','🔵','🔻','🔶','🔷','🔸','🔹'
];

function getEmoji() {
  return emojis[Math.floor(Math.random() * emojis.length)];
};

function getRandomInt(max) {
    return Math.floor(Math.random() * max);
}

var s = '';

for (var i = 0; i < 3; i++)
{
    const index = getRandomInt(tearim_shaliach.length);
    const s1 = tearim_shaliach[index];
    tearim_shaliach.splice(index, 1);
    s += ((s1) + s1[s1.length - 1].repeat(i) + '?' + getEmoji());
}
document.getElementById('tearim-shlichim').innerHTML = 'אתה ' + s

const snif = sninfim_names[getRandomInt(sninfim_names.length)]
document.getElementById('snif').innerHTML += snif + getEmoji() + getEmoji()

s = '';
for (var i = 0; i < 4; i++)
{
    const index = getRandomInt(tearim_snif.length);
    const s1 = tearim_snif[index];
    tearim_snif.splice(index, 1);
    s += ((s1) + s1[s1.length - 1].repeat(i) + getEmoji() + ',');
}
s = s.slice(0, s.length - 1)
document.getElementById('tearim-snif').innerHTML += s;
for (var i = 1; i < 4; i++)
    document.getElementById('emoji' + i).innerHTML = getEmoji();

s = '';
for (var i = 0; i < 3; i++)
{
    const index = getRandomInt(alenu.length);
    const s1 = alenu[index];
    alenu.splice(index, 1);
    s += ((s1) + getEmoji() + ',');
}
s = s.slice(0, s.length - 1);
document.getElementById('alenu').innerHTML += s + ' - עלינווו';

document.getElementById('snif2').innerHTML += snif + getEmoji();

document.getElementById('komo').innerHTML += `${komo[getRandomInt(komo.length)]} ${komo[getRandomInt(komo.length)]} הקומונרית:`;

const phone = document.getElementById('phone')
phone.innerHTML = '0' + numbers[getRandomInt(numbers.length)];

phone.href = 'https://wa.me/972' + phone.innerHTML + '?text=היי,+אשמח+לשמוע+פרטים+על+השליחות+בסניף+המגניב+שלכם.';

let whatsappLinkText;
const whatsappLink = document.getElementById('shareBtn');

window.shareViaWhatsapp = () => {
    whatsappLinkText = 'https://api.whatsapp.com/send?text='
    whatsappLinkText += document.getElementById('tearim-shlichim').innerText;
    whatsappLinkText += '%0a'
    whatsappLinkText += document.getElementById('snif').innerText;
    whatsappLinkText += '%0a'
    whatsappLinkText += document.getElementById('tearim-snif').innerText;
    whatsappLinkText += '%0a'
    whatsappLinkText += document.getElementById('mehapes').innerText;
    whatsappLinkText += '%0a'
    whatsappLinkText += document.getElementById('alenu').innerText;
    whatsappLinkText += '%0a'
    whatsappLinkText += document.getElementById('avira').innerText;
    whatsappLinkText += '%0a'
    whatsappLinkText += document.getElementById('mehacim').innerText;
    whatsappLinkText += '%0a'
    whatsappLinkText += document.getElementById('snif2').innerText;
    whatsappLinkText += '%0a'
    whatsappLinkText += document.getElementById('komo').innerText;
    whatsappLinkText += '%0a'
    whatsappLinkText += document.getElementById('phone').innerText;
    whatsappLinkText += '%0a'
    whatsappLinkText += '%0a'
    whatsappLinkText += 'הודעת שליחים זו נוצרה ע"י שליחון. נסו את שליחון בקישור:'
    whatsappLinkText += '%0a'
    whatsappLinkText += 'http://shvushon.github.io/shlichim'
    whatsappLink.setAttribute('href', whatsappLinkText)
    console.log(whatsappLinkText)   
}